{
  "releases": [
    {
      "release": "Product notices",
      "features": [
        {
          "feature": "Salesforce Lightning Experience",
          "description": "<p>In the upcoming April release, the CIC for Salesforce integration will support the new CIC for Salesforce Lightning Experience.<\/p> <p>The CIC for Salesforce Lightning integration offers significant advantages over the CIC for Salesforce integration in the Classic mode. In Classic mode, every time an agent takes an action, a new CIC session is created. This puts an additional load on the IC Server and off-server Session Managers. Lightning mode eliminates those page refreshes. The soft phone does not have to reload when Salesforce reloads with each page refresh. The CIC for Salesforce integration can then use one session for the duration of the day, improving the scalability of CIC for Salesforce.<\/p> <p>For more information about the differences between Salesforce Classic and Salesforce Lightning Experience, see the Salesforce website: <a href=\"https:\/\/help.salesforce.com\/articleView?id=lex_gaps_limitations.htm&amp;amp;type=0\">What are the Gaps Between Lightning Experience and Salesforce Classic<\/a> and the <a href=\"https:\/\/help.salesforce.com\/home\">Salesforce Help Portal<\/a>.<\/p>"
        },
        {
          "feature": "IPA Process Automation Server Version 1",
          "description": "<p>In CIC 2017 R1, version 2 of the Process Automation Server subsystem in Interaction Process Automation will replace the original version of the subsystem. That release, which is estimated to be available in November 2016, will no longer include Process Automation Server version 1 in the installation, and Process Automation Server version 2 will be installed by default. It will not be possible to roll back from version 2 to version 1.<\/p> <p>Customers who use Process Automation Server version 1 should upgrade to Process Automation Server version 2 using the migration tools before upgrading to CIC 2017 R1 or later versions. For more information about the migration tools and the differences between the two versions of Process Automation Server, see the <a href=\"http:\/\/help.inin.com\/cic\/mergedProjects\/wh_tr\/desktop\/pdfs\/process_automation_tr.pdf\">Interaction Process Automation Technical Reference<\/a>.<\/p> <p class=\"note\"><strong>Note<\/strong>: Software updates for CIC 2017 R1 and later will apply only to Process Automation Server version 2. There are no restrictions on the sale of Interaction Process Automation licenses.<\/p>"

        },
        {
          "feature": "Interaction Monitor",
          "description": "<p>Starting in CIC 2017 R2, CIC will use and require TLS 1.1 to better support PCI compliance. The PCI Council's Data Security Standard version 3.1 mandates this change. However, Interaction Monitor 1.0 requires TLS 1.0, so it will not be compatible with CIC 2017 R2 and subsequent releases. CIC releases prior to CIC 2017 R2 will continue to support Interaction Monitor.<\/p> <p>In addition, the latest version of firmware that Interaction Monitor supports on the AudioCodes gateway (Mediant 1000 and Mediant 2000) includes: M1000a: 6.40a.018.007, M1000b: 6.80A.261.013, M2000: 6.40a.063.001. For more information about firmware, see page 4 of the <a href=\"https:\/\/my.inin.com\/products\/ic30\/Documentation\/mergedProjects\/wh_imon\/bin\/interaction_monitor_server_implementation_guide.pdf\">Interaction Monitor Server Implementation Guide<\/a>.<\/p>"
        },
        {
          "feature": "Legacy Salesforce Integrations",
          "description": "<p>Updated Sept. 15, 2016<\/p> <p>CIC's integration with Salesforce Desktop will no longer be available for installation or use starting with CIC 2017 R1, which is estimated to be available in November 2016. Salesforce no longer supports the <a href=\"https://help.salesforce.com/apex/HTViewSolution?urlname=CTI-Toolkit-Retirement-in-Spring-17&amp;language=en_US\">CTI Toolkit<\/a>, which will stop working by February 2017. The CTI Toolkit is the foundation of the CIC Salesforce Desktop integration. Based on Salesforce's end of support, the Salesforce Desktop integration is end-of-life and no longer supported in CIC 2017 R1 and later versions.<\/p> <p>The IC Integration for Salesforce Web will no longer be available for installation or use starting with CIC 2017 R2, which is estimated to be available in February 2017. This Salesforce Web integration will remain under standard support terms, but will no longer be available for sale or updates in CIC 2017 R2 and later versions.<\/p> <p>Customers using these legacy Salesforce integrations should move to the newer CIC for Salesforce integration, which was released in July 2015, and includes numerous enhancements. For more information about the CIC for Salesforce integration, see the <a href=\"http://help.inin.com/cic/desktop/salesforce.htm\">CIC for Salesforce<\/a> help.<\/p> <p><strong>Note:<\/strong> The CIC for Salesforce integration is released on a different schedule from CIC and therefore it has its own <a title=\"CIC for Salesforce Release Notes link\" href=\"http:\/\/help.inin.com\/cic\/mergedProjects\/wh_sfcic\/desktop\/release_notes_cic4sf.htm\">CIC for Salesforce Release Notes</a> list as well as a <q><a title=\"What's new in CIC for Salesforce topic link\" href=\"http:\/\/help.inin.com\/cic\/mergedProjects\/wh_sfcic\/desktop\/what_s_new_in_cic_for_salesforce.htm\">What's new in CIC for Salesforce<\/a><\/q> topic.<\/p>"
        },
        {
          "feature": "Internet Explorer 10",
          "description": "<p>Added Nov. 11, 2016<\/p> <p>Microsoft has <a title=\"Link to Microsoft page for IE support statement\" href=\"https:\/\/www.microsoft.com\/en-us\/WindowsForBusiness\/End-of-IE-support\" target=\"_blank\">ended support of Internet Explorer 10<\/a> (IE10) as of January 16, 2016. This means that IE10 no longer receives security updates or fixes, and that third-party libraries that once supported IE10 may no longer be updated as well. Therefore, the last CIC release in which Interaction Connect supports IE10 is CIC 2017 R2. CIC customers using IE10 should plan to upgrade to Internet Explorer 11 (IE11) or another <a title=\"Link to CIC Software Requirements for web browsers\" href=\"http:\/\/help.inin.com\/cic\/desktop\/software_requirements.htm#webbrowser\" target=\"_blank\">currently supported web browser<\/a> for Interaction Connect before upgrading to CIC 2017 R3 or later.<\/p> <p>In addition, CIC for Salesforce will no longer support IE10 after December 31, 2016.<\/p>"
        },
        {
          "feature": "Updates for Previous Releases",
          "description": "<ul> <li> <p>Starting in CIC 2016 R2, CIC supports Windows 10 and Microsoft Edge.<\/p> <\/li> <li> <p>Starting in CIC 2016 R1, CIC supports Microsoft Exchange Server 2016 for Exchange Web Services.<\/p> <\/li> <\/ul> <p>For more information about support for Windows 10, Microsoft Edge, and Microsoft Exchange Server 2016, see <a href=\"https:\//my.inin.com\/products\/cic\/Pages\/Software-Requirements.aspx\">CIC System Software Requirements<\/a>.<\/p>"
        },
        {
          "feature": "Legacy SMS Gateway Broker Deprecated",
          "description": "<p>Added Oct. 6, 2016<\/p> <p>CIC 4.0 SU4 added support and configuration options for multiple HTTP-based SMS brokers as the preferred SMS interface. By the time of CIC 4.0 SU6, CIC no longer supported the SMS Gateway-based interface, but the configuration options remained in Interaction Administrator. Starting in CIC 2017 R2, the SMS Gateway configuration options will be removed from Interaction Administrator and anyone still using the SMS Gateway interface needs to move to the HTTP-based SMS interface.<\/p> <figure><img src=\"https:\/\/help.genesys.com\/cic\/mergedprojects\/wh_rn\/desktop\/smsgateway.jpg\" alt=\"\" \/><\/figure>"
        }]
    },
    {
      "release": "2017 R4",
      "features": [
        {
          "feature":"End of Service for Web Client",
          "description":"<p>Interaction Client Web Edition has reached its end of service date.  Interaction Connect is a web-based client that supports the features available in Interaction Client Web Edition.<\/p> <p>Interaction Client Mobile Web Edition and the IC Web Integration to Salesforce.com have also reached their end of service dates.<\/p>"
        },
        {
          "feature": "Interaction Connect Scripter Integration",
          "description": "<p>The Interaction Scripter integration enables you to process outbound calls placed by Interaction Dialer. The new Interaction Scripter view contains information pertaining to the call, the customer, and the campaign, based on behavior defined in a script. This information appears in a form that you complete. All information that you collect or modify during the call is routed back to database tables. The features available in the Interaction Scripter view are very similar to those in Interaction Scripter .NET Client (sometimes called the Dialer client.) For more information, see the Interaction Connect help.<\/p> <figure><img src=\"https:\//help.genesys.com\/cic\/mergedprojects\/wh_rn\/desktop\/scripter_standard_form_75.gif\" alt=\"\" \/><\/figure>"
        },
        {
          "feature": "Interaction Connect Customize Queue Control Toolbar",
          "description": "<p>You can add, remove, or rearrange buttons on Queue Control toolbars. Right-click anywhere in a Queue Control toolbar and click <strong>Customize Toolbar<\/strong>.<\/p> <figure><img src=\"https:\/\/help.genesys.com\/cic\/mergedprojects\/wh_rn\/desktop\/basl_customize_toolbar_2017_r4.gif\" alt=\"\" \/><\/figure>"
        }
      ]
    },
    {
      "release": "2017 R3",
      "features": [{
          "feature": "Time Stamp Added to Trace Log File Names",
          "description": "<p>Trace log files will now include the date and time of creation in the <samp>.zip<\/samp> file name. The zipping process now appends the creation time of the unzipped log file to make it easier to locate and identify the appropriate trace logs. For example, instead of a file name <samp>notifier_1.zip<\/samp>, the file name is <samp>notifier_1-2016102524355.zip<\/samp>, which was created at 02:33:55 on 2016\/10\/25.<\/p>"
        },
        {
          "feature": "CIC Data Dictionary Improvements",
          "description": "A new webpage for the CIC Data Dictionary will now be accessible from our support pages at <a href=\"http:\/\/help.inin.com\">http:\/\/help.inin.com<\/a>. This online reference replaces the current <i>CIC Data Dictionary Technical Reference<\/i> document and will now be updated regularly with PureConnect releases.<p>Along with a new webpage, there are improvements to the maintainability and the content of the information on the reporting CIC Data Dictionary. The webpage is now accurately maintained by extracting the content from current database schemas. The improvements also include additional table column information and consistency of the table information throughout the data dictionary. Examples of additional column information include: table and column change versions and change reasons; whether a table contains personally identifiable information (PII); and information about the views and stored procedures used by Interaction Reporter.<\/p><figure><img src=\"https:\/\/help.genesys.com\/cic\/mergedprojects\/wh_rn\/desktop\/cic_data_dictionary_webpage.gif\" title=\"CIC Data Dictionary webpage\" alt=\"\" \/><figcaption>The new reporting CIC Data Dictionary webpage<\/figcaption><\/figure> <p>Changes have also been made to the way we build our database scripts. This might produce differences with some database objects when comparing schemas against an older IC database install. These differences will also appear in the Database Schema Change Library on the Product Information website. Even though these changes show up as differences, they are still functionally equivalent to the previous version of these objects and will make change tracking more robust for future changes.<\/p>"
        },
        {
          "feature": "Interaction Client New Default Status Icons",
          "description": "A set of more modern status icons has been available for the CIC client since CIC 2015 R2. It is now the default set. The new default set is stored in <samp>\\\\<var>icserver<\/var>\\Resources<\/samp>. <p class=\"note\"><strong>Note<\/strong>: The older set is still available in <samp>\\\\<var>icserver<\/var>\\Resources\\alternates<\/samp>. You can configure the icon used for each status in <strong>Interaction Administrator<\/strong>  &gt; <strong>System Configuration\/strong> &gt; <strong>Status Messages<\/strong>.<\/p>"
        },
        {
          "feature": "Interaction Connect Camp",
          "description": "<p>Camp is a function that can watch another user's status and alert you when that status changes. When another CIC client user in your organization is currently unable to take your call, you can camp on that person's extension until that person becomes available.<\/p> <p>When the person's status changes to an available type, an alert appears. To call the user, click Call Now.<\/p> <figure><img src=\"https:\/\/help.genesys.com\/cic\/mergedprojects\/wh_rn\/desktop\/alert_camp_call_now_icbasl.gif\" alt=\"\" \/><\/figure>"
        }
      ]
    },
    {
      "release": "2017 R2",
      "features": [{
          "feature": "2017 R2 Feature name 01",
          "description": "Description for 2017 R2 feature 01"
        },
        {
          "feature": "2017 R2 Feature name 02",
          "description": "Description for 2017 R2 feature 02"
        },
        {
          "feature": "2017 R2 Feature name 03",
          "description": "Description for 2017 R2 feature 03"
        }
      ]
    }
  ]
}
